#include "fragment59.h"
#include "src/12D80.h"
#include "src/1C720.h"
#include "src/1CF30.h"
#include "src/20470.h"
#include "src/232C0.h"
#include "src/26820.h"
#include "src/29BA0.h"
#include "src/2C1C0.h"
#include "src/2E110.h"
#include "src/3FB0.h"
#include "src/49790.h"
#include "src/DDC0.h"
#include "src/F420.h"
#include "src/geo_layout.h"
#include "src/math_util.h"
#include "src/memory.h"
#include "src/stage_loader.h"

typedef struct unk_D_84102450 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ s8 unk_08;
    /* 0x09 */ s8 unk_09;
    /* 0x0A */ s8 unk_0A;
    /* 0x0B */ s8 unk_0B;
} unk_D_84102450; // size = 0xC

typedef struct unk_D_84102498 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
} unk_D_84102498; // size = 0xC

static char** D_84103440;
static BinArchive* D_84103444;
static void* D_84103448;
static void* D_8410344C;
static Vtx* D_84103450;
static GraphNode* D_84103454;
static unk_D_86002F58_004_000 D_84103458[6];
static s16 D_84103CC8;
static unk_D_80068BB0* D_84103CD0[6];
static GraphNode* D_84103CE8;
static GraphNode* D_84103CEC;
static unk_func_80027FA0 D_84103CF0;

static u8 D_84102430[] = {
    0x09, 0x07, 0x08, 0x0C, 0x0A, 0x0B,
};
static s16 D_84102438[] = { 3, 1, 2, 6, 4, 5 };
static s16 D_84102444[] = { 3, 1, 2, 6, 4, 5 };
static unk_D_84102450 D_84102450[] = {
    {
        244,
        70,
        152,
        114,
        -1,
        3,
        4,
        5,
    },
    {
        88,
        88,
        128,
        96,
        -1,
        -1,
        -1,
        -1,
    },
    {
        424,
        88,
        128,
        96,
        -1,
        -1,
        -1,
        -1,
    },
    {
        244,
        212,
