#include "fragment17.h"
#include "src/12D80.h"
#include "src/17300.h"
#include "src/18140.h"
#include "src/geo_layout.h"
#include "src/19840.h"
#include "src/1C720.h"
#include "src/1CF30.h"
#include "src/20330.h"
#include "src/20470.h"
#include "src/26820.h"
#include "src/2E110.h"
#include "src/3FB0.h"
#include "src/49790.h"
#include "src/4BDC0.h"
#include "src/4F410.h"
#include "src/6A40.h"
#include "src/6BC0.h"
#include "src/F420.h"
#include "src/controller.h"
#include "src/math_util.h"
#include "src/memory.h"
#include "src/stage_loader.h"
#include "src/fragments/3/fragment3.h"

extern u8 D_30074E0[];
extern u8 D_30092E0[];
extern u8 D_300B6E0[];
extern u8 D_300B980[];
extern u8 D_300BAD0[];
extern u8 D_300BED0[];
extern u8 D_300C2D0[];

s32 func_86B024D0(s32, GraphNode*);
s32 func_86B02538(s32, GraphNode*);

typedef struct unk_D_86B0DBCC {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
} unk_D_86B0DBCC; // size = 0x10

typedef struct unk_D_86B0DB98 {
    /* 0x00 */ u8* unk_00;
    /* 0x04 */ s16 unk_04;
} unk_D_86B0DB98; // size = 0x8

typedef struct unk_D_86B0EBD8 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ char unk10[0x8];
    /* 0x18 */ s32 unk_18;
    /* 0x30 */ unk_D_86B0DAE0 unk_1C;
} unk_D_86B0EBD8; // size = 0x4C

typedef struct unk_D_86B0EBDC {
    /* 0x000 */ unk_D_86002F30* unk_000;
    /* 0x004 */ unk_D_86002F30* unk_004;
    /* 0x008 */ unk_D_86002F58_004_000 unk_008;
    /* 0x170 */ unk_D_86002F58_004_000 unk_170;
    /* 0x2D8 */ s32 unk_2D8;
    /* 0x2DC */ s32 unk_2DC;
    /* 0x2E0 */ char unk2E0[0x4];
    /* 0x2E4 */ s32 unk_2E4;
    /* 0x2E8 */ s32 unk_2E8;
    /* 0x2EC */ s32 unk_2EC;
    /* 0x2F0 */ s32 unk_2F0;
    /* 0x2F4 */ f32 unk_2F4;
    /* 0x2F8 */ char unk2F8[0x4];
    /* 0x2FC */ f32 unk_2FC;
    /* 0x300 */ f32 unk_300;
    /* 0x304 */ s32 unk_304;
    /* 0x308 */ s32 unk_308;
} unk_D_86B0EBDC; // size = 0x30C

typedef struct unk_D_86B0EBE0 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s16 unk_14;
    /* 0x16 */ s16 unk_16;
    /* 0x18 */ s16 unk_18;
    /* 0x1A */ s16 unk_1A;
    /* 0x1C */ s16 unk_1C;
} unk_D_86B0EBE0; // size = 0x20

u32 D_86B0BD60[] = {
    0xCFFFCFFF, 0xCFFFCFFF, 0xCFFFCFFF, 0xCFFFCFFF, 0xCFFFCFFF, 0xCFFFCFFF, 0xCFFFCFFF, 0xCFFFCFFF, 0xC7FFC7FF,
    0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF,
    0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xC7FFC7FF,
    0xC7BFC7FF, 0xC7FFC7FF, 0xC7FFC7FF, 0xBFFFBFFF, 0xBFFFBFFF, 0xBFBFC7BF, 0xBFBFBFBF, 0xBFBFBFBF, 0xBFBFBFBF,
    0xBFBFBFBF, 0xBFBFBFBF, 0xBFBFBFBF, 0xBFBFBFBF, 0xBFBFBFBF, 0xBFBFBFBF, 0xBFBFBFBF, 0xBF7FBFBF, 0xBFBFBFBF,
    0xBFBFBFBF, 0xBF7FBF7F, 0xBF7FBF7F, 0xB77FB77F, 0xB77FB77F, 0xB77FB77F, 0xB77FB77F, 0xB77FB77F, 0xB77FB77F,
    0xB77FB77F, 0xB77FB77F, 0xB77FB77F, 0xB77FB77F, 0xB77FB77F, 0xB77FB77F, 0xB73FAF3F, 0xB73FAF3F, 0xB73FAF3F,
    0xAF3FB73F, 0xAF3FAF3F, 0xAF3FAF3F, 0xAF3FAF3F, 0xAF3FAF3F, 0xAF3FAF3F, 0xAEFFAF3F, 0xAF3FAF3F, 0xAF3FAF3F,
