#include "fragment50.h"
#include "src/12D80.h"
#include "src/19840.h"
#include "src/1AB70.h"
#include "src/1C720.h"
#include "src/1CF30.h"
#include "src/20330.h"
#include "src/20470.h"
#include "src/232C0.h"
#include "src/26820.h"
#include "src/2E110.h"
#include "src/32D10.h"
#include "src/3FB0.h"
#include "src/49790.h"
#include "src/4BDC0.h"
#include "src/6A40.h"
#include "src/6BC0.h"
#include "src/DDC0.h"
#include "src/F420.h"
#include "src/controller.h"
#include "src/geo_layout.h"
#include "src/memory.h"
#include "src/stage_loader.h"
#include "src/util.h"

typedef struct unk_D_82607420 {
    /* 0x000 */ s32 unk_000;
    /* 0x004 */ unk_D_86002F58_004_000_010_024* unk_004;
    /* 0x008 */ unk_D_86002F58_004_000 unk_008;
} unk_D_82607420; // size = 0x170

typedef struct unk_D_82604180 {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ u16 unk_06;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
} unk_D_82604180; // size = 0x14

static s32 pad_D_82607410[2];
static GraphNode* D_82607418;
static unk_D_86002F58_004_000_010* D_8260741C;
static unk_D_82607420 D_82607420[5];
static s16 D_82607B50;
static s16 D_82607B52;
static s16 D_82607B54;
static s32 pad_D_82607B58[2];
static unk_D_86002F58_004_000 D_82607B60[5];
static unk_D_86002F58_004_000 D_82608268;
static unk_D_86002F58_004_000 D_826083D0;
static unk_D_86002F30* D_82608538;
static s16 D_8260853C;
static s16 D_8260853E;
static s16 D_82608540;
static s16 D_82608542;
static s16 D_82608544;
static s16 D_82608546;
static s16 D_82608548;
static s16 D_8260854A;
static s16 D_8260854C;
static s16 D_8260854E;
static s16 D_82608550;
static s16 D_82608552;
static s16 D_82608554;
static s16 D_82608556;
static unk_D_86002F34_00C* D_82608558;
static s32 pad_D_82608560[2];
static u16 D_82608568[151][0x640];
static s16 D_8267E4E8;
static u16 D_8267E4EA;
static u16 D_8267E4EC;
static u32 D_8267E4F0;
