#ifndef _FRAGMENT34_H_
#define _FRAGMENT34_H_

#include "global.h"

typedef void (*func_unk_D_8140E720_008)(struct unk_D_8140E720*);
typedef void (*func_unk_D_8140E720_00C)(struct unk_D_8140E720*, unk_D_86002F34_00C*);
typedef void (*unk_D_8140E728_01C_004_1_04)(struct unk_D_8140E720*, s32, struct unk_D_8140E728_01C_004_1*);
typedef void (*unk_D_8140E728_01C_004_1_08)(struct unk_D_8140E720*, s32, struct unk_D_8140E728_01C_004_1*);

typedef struct unk_D_8140E728_01C_00C_1 {
    /* 0x00 */ s32 arg;
} unk_D_8140E728_01C_00C_1;

typedef union unk_D_8140E728_01C_00C {
    s32 arg;
    unk_D_8140E728_01C_00C_1* s;
} unk_D_8140E728_01C_00C;

typedef struct unk_D_8140E728_01C_004_1 {
    /* 0x00 */ u8 unk_00;
    /* 0x00 */ u8 unk_01;
    /* 0x00 */ s16 unk_02;
    /* 0x04 */ unk_D_8140E728_01C_004_1_04 unk_04;
    /* 0x08 */ unk_D_8140E728_01C_004_1_08 unk_08;
    /* 0x0C */ unk_D_8140E728_01C_00C unk_0C;
} unk_D_8140E728_01C_004_1; // size >= 0x10

typedef union unk_D_8140E728_01C_004 {
    unk_D_8140E728_01C_004_1* a;
    func_unk_D_8140E720_00C func;
} unk_D_8140E728_01C_004;

typedef struct unk_D_8140E728_01C {
    /* 0x00 */ s32 unk_00; /* unk_04: 1 = a, 3 = func */
    /* 0x04 */ unk_D_8140E728_01C_004 unk_04;
} unk_D_8140E728_01C; // size = 0x10

typedef struct unk_D_8140E728 {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ Vec3f unk_04;
    /* 0x10 */ Vec3s unk_10;
    /* 0x18 */ func_unk_D_8140E720_008 unk_18;
    /* 0x1C */ unk_D_8140E728_01C* unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ u16 unk_24;
    /* 0x26 */ s16 unk_26;
    /* 0x28 */ s16 unk_28;
    /* 0x2A */ s8 unk_2A;
    /* 0x2B */ s8 unk_2B;
    /* 0x2C */ u8 unk_2C;
    /* 0x2D */ u8 unk_2D;
    /* 0x2E */ u8 unk_2E;
    /* 0x2F */ u8 unk_2F;
} unk_D_8140E728; // size = 0x30

typedef struct unk_D_8140E720_014 {
    /* 0x00 */ char unk00[0x1D];
    /* 0x1D */ u8 unk_1D;
    /* 0x1E */ Vec3s unk_1E;
    /* 0x24 */ Vec3f unk_24;
    /* 0x30 */ Vec3f unk_30;
} unk_D_8140E720_014; // size >= 0x3C

typedef struct unk_D_8140E720 {
    /* 0x00 */ struct unk_D_8140E720* next;
    /* 0x04 */ struct unk_D_8140E720* prev;
    /* 0x08 */ func_unk_D_8140E720_008 unk_08;
    /* 0x0C */ unk_D_8140E728_01C* unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ unk_D_8140E720_014* unk_14;
    /* 0x18 */ u32 unk_18;
    /* 0x1C */ f32 unk_1C;
    /* 0x20 */ f32 unk_20;
    /* 0x24 */ f32 unk_24;
    /* 0x28 */ f32 unk_28;
    /* 0x2C */ Vec3f unk_2C;
    /* 0x38 */ Vec3f unk_38;
    /* 0x44 */ char unk44[0xC];
    /* 0x50 */ Vec3f unk_50;
    /* 0x5C */ Vec3f unk_5C;
    /* 0x68 */ Vec3f unk_68;
    /* 0x74 */ f32 unk_74;
    /* 0x78 */ f32 unk_78;
    /* 0x7C */ Vec3f unk_7C;
    /* 0x88 */ char unk88[0xC];
    /* 0x94 */ Vec3s unk_94;
    /* 0x9A */ Vec3s unk_9A;
    /* 0xA0 */ Vec3s unk_A0;
    /* 0xA6 */ s16 unk_A6;
    /* 0xA8 */ s16 unk_A8;
    /* 0xAA */ s16 unk_AA;
    /* 0xAC */ s16 unk_AC;
    /* 0xAE */ s16 unk_AE;
    /* 0xB0 */ s16 unk_B0;
    /* 0xB2 */ s16 unk_B2;
    /* 0xB4 */ char unkB4[0x2];
    /* 0xB6 */ s16 unk_B6;
    /* 0xB8 */ s16 unk_B8;
    /* 0xBA */ s16 unk_BA;
    /* 0xBC */ s16 unk_BC;
    /* 0xBE */ u8 prim_r;
    /* 0xBF */ u8 prim_g;
    /* 0xC0 */ u8 prim_b;
    /* 0xC1 */ u8 env_r;
    /* 0xC2 */ u8 env_g;
    /* 0xC3 */ u8 env_b;
    /* 0xC4 */ u8 prim_a;
    /* 0xC5 */ char unkC5[0x1];
    /* 0xC6 */ s8 unk_C6;
    /* 0xC7 */ s8 unk_C7;
    /* 0xC8 */ char unkC8[0x2];
    /* 0xCA */ u8 unk_CA;
    /* 0xCB */ char unkCB[0x1];
    /* 0xCC */ u8 unk_CC;
    /* 0xCD */ u8 unk_CD;
    /* 0xCE */ u8 unk_CE;
    /* 0xCF */ u8 unk_CF;
    /* 0xD0 */ s8 unk_D0;
} unk_D_8140E720; // size = 0xD4

typedef struct arg1_func_8140213C {
    /* 0x00 */ char unk00[0x64];
    /* 0x64 */ MtxF unk_64;
} arg1_func_8140213C; // size >= 0xA4

typedef struct arg1_func_87903D64_014 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ unk_D_86002F34_000_014_004* unk_04;
    /* 0x08 */ unk_D_86002F34_000_014_004* unk_08;
    /* 0x0C */ unk_D_86002F34_000_014_004* unk_0C;
    /* 0x10 */ unk_D_86002F34_000_014_010* unk_10;
    /* 0x14 */ unk_D_86002F34_000_014_010* unk_14;
    /* 0x18 */ unk_D_86002F34_000_014_010* unk_18;
} arg1_func_87903D64_014;

// Possibly unk_D_86002F34_alt7, unk_D_86002F34_alt8,
// unk_D_86002F34_alt9 or unk_D_86002F34_alt2
typedef struct arg1_func_87903D64 {
    /* 0x00 */ char unk00[0x14];
    /* 0x00 */ arg1_func_87903D64_014* unk_14;
    /* 0x18 */ Gfx* unk_18;
} arg1_func_87903D64; // size >= 0x1C

typedef struct arg1_func_81407874_014_000_014_000_000 {
    /* 0x00 */ Color_RGBA8 color;
    /* 0x04 */ u8 l;
} arg1_func_81407874_014_000_014_000_000; // size = 0x5

typedef struct arg1_func_81407874_014_000_018_000_000 {
    /* 0x00 */ Color_RGBA8 color;
} arg1_func_81407874_014_000_018_000_000; // size = 0x4

typedef union arg1_func_81407874_014_000_014_000 {
    arg1_func_81407874_014_000_014_000_000* ptr5;
    arg1_func_81407874_014_000_018_000_000* ptr4;
    Color_RGBA8_u32 color;
    u8** texture;
} arg1_func_81407874_014_000_014_000; // size = 0x4

typedef struct arg1_func_81407874_014_000_014 {
    /* 0x00 */ arg1_func_81407874_014_000_014_000 unk_00;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
} arg1_func_81407874_014_000_014; // size >= 0x08

typedef struct arg1_func_81407874_014_000_01C {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u16 unk_02;
} arg1_func_81407874_014_000_01C; // size >= 0x04

typedef struct arg1_func_81407874_014_000 {
    /* 0x00 */ struct arg1_func_81407874_014_000* unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ char unk08[0x8];
    /* 0x10 */ arg1_func_81407874_014_000_010* unk_10;
    /* 0x14 */ arg1_func_81407874_014_000_014* unk_14;
    /* 0x18 */ arg1_func_81407874_014_000_014* unk_18;
    /* 0x1C */ arg1_func_81407874_014_000_01C* unk_1C;
} arg1_func_81407874_014_000; // size >= 0x20

typedef struct arg1_func_81407874_014_004_008 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ s16 unk_08;
} arg1_func_81407874_014_004_008; // size >= 0xA

typedef struct arg1_func_81407874_014_004_004 {
    /* 0x00 */ s16 fmt;
    /* 0x02 */ s16 size;
    /* 0x04 */ s16 width;
    /* 0x06 */ s16 height;
    /* 0x08 */ s16 cms;
    /* 0x0A */ s16 cmt;
    /* 0x0C */ s16 masks;
    /* 0x0E */ s16 maskt;
    /* 0x10 */ s16 shfits;
    /* 0x12 */ s16 shiftt;
} arg1_func_81407874_014_004_004; // size >= 0x14

typedef struct arg1_func_81407874_014_004 {
    /* 0x00 */ arg1_func_81407874_014_000* unk_00;
    /* 0x04 */ arg1_func_81407874_014_004_004* unk_04;
    /* 0x08 */ arg1_func_81407874_014_004_008* unk_08;
    /* 0x0C */ arg1_func_81407874_014_000_014* unk_0C;
} arg1_func_81407874_014_004; // size >= 0x4

typedef struct arg1_func_81407874_014 {
    /* 0x00 */ arg1_func_81407874_014_000* unk_00;
    /* 0x04 */ arg1_func_81407874_014_004* unk_04;
} arg1_func_81407874_014; // size >= 0x8

typedef struct arg1_func_81407874 {
    /* 0x00 */ char unk00[0x14];
    /* 0x00 */ arg1_func_81407874_014* unk_14;
} arg1_func_81407874; // size >= 0x18

typedef struct unk_D_8140E634 {
    /* 0x00 */ Vec3f unk_00;
    /* 0x0C */ char unk0C[0x84];
} unk_D_8140E634; // size = 0x90

extern Gfx D_8140DAE0[];
extern Gfx D_8140DB30[];
extern Gfx D_8140DBA8[];
extern Gfx D_8140DC00[];
extern Gfx D_8140DC58[];
extern Gfx D_8140DC78[];
extern Gfx D_8140DC98[];
extern Gfx D_8140DCB8[];
extern Gfx D_8140DCD8[];
extern Gfx D_8140DCF8[];
extern Gfx D_8140DD18[];
extern Gfx D_8140DD38[];
extern Gfx D_8140DD58[];
extern Gfx D_8140DD78[];
extern Gfx D_8140DDD8[];
extern Gfx D_8140DDF8[];
extern Vtx D_8140DE78[];
extern Vtx D_8140DEF8[];
extern Vtx D_8140DF78[];
extern Vtx D_8140DFA8[];
extern Vtx D_8140DFD8[];
extern Vtx D_8140E018[];
extern Vtx D_8140E058[];
extern Vtx D_8140E098[];
extern Vtx D_8140E0D8[];
extern Vtx D_8140E108[];
extern Vtx D_8140E148[];
extern Vtx D_8140E178[];
extern Vtx D_8140E1B8[];
extern Vtx D_8140E1F8[];
extern Vtx D_8140E238[];
extern Vtx D_8140E2B8[];
extern Vtx D_8140E378[];
extern Vtx D_8140E3B8[];
extern Gfx D_8140E418[];
extern Gfx D_8140E430[];
extern Gfx D_8140E448[];
