#include "fragment42.h"
#include "src/19840.h"
#include "src/1C720.h"
#include "src/1CF30.h"
#include "src/20330.h"
#include "src/2E110.h"
#include "src/20470.h"
#include "src/3FB0.h"
#include "src/49790.h"
#include "src/4BDC0.h"
#include "src/6A40.h"
#include "src/6BC0.h"
#include "src/C030.h"
#include "src/controller.h"
#include "src/fragments/43/fragment43.h"
#include "src/memory.h"
#include "src/stage_loader.h"

typedef struct unk_D_833031B4 {
    /* 0x00 */ u8* unk_00;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ u16 unk_06;
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ s16* unk_0C;
    /* 0x10 */ s16 unk_10;
    /* 0x12 */ s16 unk_12;
    /* 0x14 */ s32 unk_14;
} unk_D_833031B4; // size = 0x18

typedef struct unk_D_83303180 {
    /* 0x00 */ u8* unk_00;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ u16 unk_06;
    /* 0x08 */ s16 unk_08;
} unk_D_83303180; // size = 0xC

static s32 D_833032E0;
static s32 D_833032E4;
static unk_D_83407B38 D_833032E8;
static BinArchive* D_8330339C;
static s32 D_833033A0;
static unk_D_83403C60 D_833033A8;
static s32 D_83303434;
static s32 D_83303438;
static s32 D_8330343C;
static s32 D_83303440;
static s32 D_83303444;

static unk_D_83303180 D_83303180[] = {
    { NULL, 0x30, 0x23, 0 },
    { D_03002A40, 0x20, 0x24, 7 },
    { NULL, 0x30, 0x23, 8 },
};

static s16 D_833031A4[] = { 0x11 };
static s16 D_833031A8[] = { 0x12 };
static s16 D_833031AC[] = { 0x13 };
static s16 D_833031B0[] = { -1, 0x15 };

static unk_D_833031B4 D_833031B4[] = {
    {
        D_03001000,
        48,
        35,
        5,
        11,
        NULL,
        1,
        0,
        28,
    },
    {
        D_3001D20,
        48,
        35,
        6,
        12,
        D_833031A4,
        1,
        0,
        28,
    },
    {
        D_03002A40,
        32,
        36,
        7,
