#ifndef _FRAGMENT40_H_
#define _FRAGMENT40_H_

#include "global.h"
#include "src/geo_layout.h"

typedef struct unk_D_83101F00 {
    /* 0x000 */ unk_D_86002F58_004_000 unk_000;
    /* 0x168 */ s16 unk_168;
    /* 0x16A */ s16 unk_16A;
    /* 0x16C */ s16 unk_16C;
    /* 0x16E */ s16 unk_16E;
    /* 0x170 */ s16 unk_170;
    /* 0x172 */ s16 unk_172;
    /* 0x174 */ s16 unk_174;
    /* 0x176 */ s16 unk_176;
    /* 0x178 */ s16 unk_178;
    /* 0x17A */ s16 unk_17A;
    /* 0x17C */ s16 unk_17C;
    /* 0x180 */ f32 unk_180;
    /* 0x184 */ f32 unk_184;
} unk_D_83101F00; // size = 0x188

void func_83100020(unk_D_86002F58_004_000* arg0);
s32 func_83100180(s32 arg0, UNUSED GraphNode* arg1);
void func_8310024C(unk_D_83101F00* arg0);
s32 func_83100578(s32 arg0, GraphNode* arg1);
void func_831006D4(void);
void func_831006F4(void);
void func_83100784(void);
void func_83100C78(s16 arg0);
void func_83100CB8(void);
void func_83100CD4(void);
void func_83100D4C(u8* arg0, s16 arg1);
void func_8310102C(void);
void func_83101074(s16 arg0);
void func_831010B0(void);
void func_831010E0(unk_D_83101F00* arg0, s16 arg1);
void func_831011D4(s16 arg0, s16 arg1, s16 arg2, s16 arg3, s16 arg4, s16 arg5, s16 arg6, s16 arg7);
void func_831013FC(void);
void func_83101608(void);
void func_83101674(void);
s32 func_831016D0(void);
void func_83101818(void);
void func_83101870(void);
s32 func_83101A98(UNUSED s32 arg0, UNUSED s32 arg1);

#endif // _FRAGMENT40_H_
