#ifndef _FRAGMENT28_H_
#define _FRAGMENT28_H_

#include "global.h"
#include "src/fragments/26/fragment26.h"

typedef struct unk_func_888044BC_038_02C_02C_000 {
    /* 0x00 */ u8 unk_00;
} unk_func_888044BC_038_02C_02C_000; // size >= 0x4

typedef struct unk_func_888044BC_038_02C_02C {
    /* 0x00 */ unk_func_888044BC_038_02C_02C_000** unk_00;
    /* 0x04 */ char unk04[0x4];
    /* 0x08 */ s32 unk_08;
} unk_func_888044BC_038_02C_02C; // size >= 0x0C

typedef struct unk_func_888044BC_038_02C_044 {
    /* 0x00 */ unk_func_88001300_000 unk_00;
} unk_func_888044BC_038_02C_044; // size >= 0x2C

typedef struct unk_func_888044BC_038_02C_000 {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ unk_func_888044BC_038_02C_02C* unk_2C;
    /* 0x30 */ char unk30[0x4];
    /* 0x34 */ u16* unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ s16 unk_3C;
    /* 0x3E */ s16 unk_3E;
    /* 0x40 */ char unk40[0x4];
    /* 0x44 */ unk_func_888044BC_038_02C_044* unk_44;
    /* 0x48 */ char unk48[0x2];
    /* 0x4A */ s16 unk_4A;
    /* 0x4C */ char unk4C[0x4];
    /* 0x50 */ unk_func_88001300_000_010 unk_50;
    /* 0x54 */ s16 unk_54;
    /* 0x58 */ s32 unk_58;
    /* 0x5C */ s32 unk_5C;
    /* 0x60 */ char unk60[0xC];
    /* 0x6C */ s32 unk_6C;
} unk_func_888044BC_038_02C_000; // size = 0x70

typedef struct unk_func_888044BC_038_02C {
    /* 0x00 */ unk_func_888044BC_038_02C_000 unk_00;
    /* 0x70 */ unk_func_88205880_A030 unk_70;
    /* 0x7C */ unk_func_88205880_A030 unk_7C;
    /* 0x88 */ s32 unk_88;
    /* 0x8C */ s32 unk_8C;
} unk_func_888044BC_038_02C; // size = 0x90

typedef struct unk_func_888044BC_038 {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ unk_func_888044BC_038_02C* unk_2C;
} unk_func_888044BC_038; // size = 0x30

typedef struct unk_func_888044BC_03C_02C {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ char unk_30[8];
    /* 0x38 */ unk_func_88200FA0_030_038* unk_38;
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ s32 unk_40;
    /* 0x44 */ s32 unk_44;
} unk_func_888044BC_03C_02C; // size = 0x48

typedef struct unk_func_888044BC_03C {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ unk_func_888044BC_03C_02C* unk_2C;
} unk_func_888044BC_03C; // size = 0x30

typedef struct unk_func_888044BC_040_030 {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ s32 unk_2C;
} unk_func_888044BC_040_030; // size = 0x30

typedef struct unk_func_888044BC_040 {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ char unk2C[0x4];
    /* 0x30 */ unk_func_888044BC_040_030* unk_30;
    /* 0x34 */ unk_func_88200FA0_030_030* unk_34;
    /* 0x38 */ unk_func_88200FA0_030_038 unk_38;
} unk_func_888044BC_040; // size = 0x44

typedef struct unk_func_888044BC_044_02C {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ s32 unk_2C;
} unk_func_888044BC_044_02C; // size = 0x30

typedef struct unk_func_888044BC_044 {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ unk_func_888044BC_044_02C* unk_2C;
} unk_func_888044BC_044; // size = 0x30

typedef struct unk_func_888044BC_048 {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ unk_func_8850878C* unk_2C;
} unk_func_888044BC_048; // size = 0x30

typedef struct unk_func_888044BC_04C_02C {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ s32 unk_2C;
} unk_func_888044BC_04C_02C; // size = 0x30

typedef struct unk_func_888044BC_04C {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ unk_func_888044BC_04C_02C* unk_2C;
} unk_func_888044BC_04C; // size = 0x30

typedef struct unk_func_888044BC_050 {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ unk_func_888044BC_038_02C* unk_2C;
    /* 0x30 */ s32 unk_30;
} unk_func_888044BC_050; // size = 0x34

typedef struct unk_func_888044BC {
    /* 0x00 */ unk_func_88001300_000 unk_00;
    /* 0x2C */ unk_func_88500994* unk_2C;
    /* 0x30 */ unk_func_88500994* unk_30;
    /* 0x34 */ unk_func_88001300_02C* unk_34;
    /* 0x38 */ unk_func_888044BC_038* unk_38;
    /* 0x3C */ unk_func_888044BC_03C* unk_3C;
    /* 0x40 */ unk_func_888044BC_040* unk_40;
    /* 0x44 */ unk_func_888044BC_044* unk_44;
    /* 0x48 */ unk_func_888044BC_048* unk_48;
    /* 0x4C */ unk_func_888044BC_04C* unk_4C;
    /* 0x50 */ unk_func_888044BC_050* unk_50;
    /* 0x54 */ unk_func_888044BC_050* unk_54;
} unk_func_888044BC; // size = 0x58

void func_88800020(s32 arg0, s32 arg1, s32 arg2);
s32 func_888002F8(unk_func_888044BC_050* arg0, s32 arg1, s32 arg2);
void func_88800A3C(s32 arg0, s32 arg1, char* arg2, UNUSED s32 arg3, s32 arg4, unk_func_888044BC_038_02C* arg5);
void func_88800E20(unk_func_888044BC_038_02C* arg0, s32 arg1, s32 arg2, s32 arg3, s32 arg4, MemoryPool* arg5);
s32 func_88801030(unk_func_888044BC_038_02C* arg0);
void func_88801054(unk_func_888044BC_038_02C* arg0);
void func_88801164(unk_func_888044BC_038* arg0, s32 arg1, s32 arg2, s32 arg3, MemoryPool* arg4);
s32 func_88801214(unk_func_888044BC_038* arg0, Controller* arg1);
void func_8880123C(s32 arg0, s32 arg1, s32 arg2, s32 arg3, Color_RGBA8 arg4);
void func_888018E0(unk_func_888044BC_03C_02C* arg0, s32 arg1, s32 arg2);
void func_8880193C(unk_func_888044BC_03C_02C* arg0, s32 arg1);
void func_888019A4(unk_func_888044BC_03C_02C* arg0, s32 arg1, s32 arg2);
void func_88801CB4(unk_func_888044BC_03C* arg0, s32 arg1, s32 arg2, s32 arg3, MemoryPool* arg4);
void func_88801DB8(unk_func_888044BC_040_030* arg0, s32 arg1, s32 arg2);
s32 func_88801E1C(unk_func_888044BC_040_030* arg0, s32 arg1, s32 arg2);
void func_88802228(unk_func_888044BC_040_030* arg0);
void func_88802238(s32 arg0, s32 arg1, char* arg2, UNUSED s32 arg3, UNUSED s32 arg4, unk_func_88200FA0_030_030* arg5);
void func_8880231C(unk_func_888044BC_040* arg0, s32 arg1, s32 arg2, MemoryPool* arg3);
s32 func_88802598(unk_func_888044BC_040* arg0, Controller* arg1);
void func_888025C0(unk_func_888044BC_044_02C* arg0, s32 arg1, s32 arg2);
void func_8880261C(unk_func_888044BC_044_02C* arg0, s32 arg1);
void func_88802624(s32 arg0, s32 arg1, s32 arg2);
void func_888026D8(s32 arg0, s32 arg1, s32 arg2);
s32 func_8880276C(unk_func_888044BC_044_02C* arg0, s32 arg1, s32 arg2);
void func_88802B88(unk_func_888044BC_044* arg0, s32 arg1, s32 arg2, MemoryPool* arg3);
void func_88802C80(unk_func_888044BC_048* arg0, s32 arg1, s32 arg2, MemoryPool* arg3);
void func_88802DAC(unk_func_888044BC_048* arg0, s32 arg1, s32 arg2);
void func_88802E68(unk_func_888044BC_04C_02C* arg0, s32 arg1, s32 arg2);
void func_88802EC4(unk_func_888044BC_04C_02C* arg0, s32 arg1);
s32 func_88802F10(unk_func_888044BC_04C_02C* arg0, s32 arg1, s32 arg2);
void func_8880316C(unk_func_888044BC_04C* arg0, s32 arg1, s32 arg2, MemoryPool* arg3);
void func_888031FC(unk_func_888044BC* arg0, s32 arg1, s32 arg2, u8* arg3, MemoryPool* arg4);
s32 func_88803614(void);
u8 func_888038E0(void);
void func_88803BCC(u8* arg0, s32 arg1);
s32 func_88803C74(void);
s32 func_88803ECC(void);
s32 func_88803FB0(u8 arg0);
void func_88804020(void);
void func_8880412C(void);
s32 func_88804190(void);
s32 func_88804218(u8 arg0);
void func_88804288(void);
s32 func_8880431C(void);
void func_88804370(void);
s32 func_888044BC(UNUSED s32 arg0, UNUSED s32 arg1);


s32 func_888047D0(s32 arg0);
s32 func_88804B1C(s32 arg0);
void func_88804E68(void);
void func_88804EC8(void);
void func_8880554C(void);
Gfx* func_88805960(Gfx* arg0, s16 arg1, s16 arg2);
Gfx* func_88805AEC(Gfx* arg0, s32 arg1, s32 arg2, s32 arg3, s32 arg4, s32 arg5, s32 arg6);
void func_888069B0(void);
void func_88806EAC(void);
void func_88806EC8(void);
void func_88806F20(Vec3f* arg0, Vec3f* arg1);
void func_88807090(void);
s32 func_888071C8(s32 arg0);
s32 func_8880725C(UNUSED u8 arg0);
s32 func_88807AC0(void);
void func_88807D04(s32 arg0, MainPoolState* arg1, UNUSED s32 arg2, s32 arg3, s32 arg4, char* arg5, char** arg6);
void func_8880812C(void);

#endif // _FRAGMENT28_H_
