#include "fragment28.h"
#include "src/11BA0.h"
#include "src/12D80.h"
#include "src/19840.h"
#include "src/1CF30.h"
#include "src/22630.h"
#include "src/29BA0.h"
#include "src/2E110.h"
#include "src/2E460.h"
#include "src/30640.h"
#include "src/37370.h"
#include "src/3FB0.h"
#include "src/6A40.h"
#include "src/F420.h"
#include "src/geo_layout.h"
#include "src/memory.h"
#include "src/stage_loader.h"

typedef struct unk_D_88826A88 {
    /* 0x00 */ char unk_00[1]; // unk size
    /* 0x01 */ char unk01[0x2C];
    /* 0x2D */ char unk_2D[15];
    /* 0x3C */ char unk_3C[15];
    /* 0x4B */ char unk_4B[15];
    /* 0x5A */ s16 unk_5A;
} unk_D_88826A88; // size = 0x5C

typedef struct unk_D_88826CF0_004 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
} unk_D_88826CF0_004; // size = 0x8

typedef struct unk_D_88826CF0 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ unk_D_88826CF0_004* unk_04[1];
    /* 0x08 */ char unk08[0x10];
    /* 0x18 */ s16 unk_18[1];
    /* 0x1A */ char unk1A[0xA];
} unk_D_88826CF0; // size = 0x24

typedef struct unk_D_88825ECC {
    /* 0x00 */ char unk_00[14];
    /* 0x0E */ s16 unk_0E;
} unk_D_88825ECC; // size = 0x10

typedef struct unk_D_88826444 {
    /* 0x00 */ s16 unk_00;
    /* 0x00 */ s16 unk_02;
} unk_D_88826444; // size = 0x4

static unk_func_80011B94 D_888269C0;
static unk_func_80011B94 D_888269E0;
static unk_func_80011B94 D_88826A00;
static unk_func_80011B94 D_88826A20;
static char** D_88826A3C;
static s32 pad_D_88826A40;
static GraphNode* D_88826A44;
static char** D_88826A48;
static s16 D_88826A4C;
static s16 D_88826A4E;
static s16 D_88826A50;
static s16 D_88826A52;
static s16 D_88826A54;
static s16 D_88826A56;
static s16 D_88826A58;
static char D_88826A60[0x1E];
static u16 D_88826A7E;
static s16 D_88826A80;
static unk_D_88826A88 D_88826A88[6];
static s16 D_88826CB0;
static s16 D_88826CB2;
static s16 D_88826CB4;
static s16 D_88826CB8[7];
static s16 D_88826CC6;
static s16 D_88826CC8;
static s16 D_88826CCA;
static s16 D_88826CCC;
static s16 D_88826CCE;
static s16 D_88826CD0;
static u8* D_88826CD4;
static f32 D_88826CD8;
static s32 D_88826CDC;
static char* D_88826CE0;
static char* D_88826CE4;
static Mtx* D_88826CE8;
