#include "fragment15.h"
#include "src/fragments/3/fragment3.h"
#include "src/fragments/34/fragment34.h"
#include "src/fragments/43/fragment43.h"
#include "src/11BA0.h"
#include "src/12D80.h"
#include "src/17300.h"
#include "src/18140.h"
#include "src/geo_layout.h"
#include "src/19840.h"
#include "src/1CF30.h"
#include "src/20330.h"
#include "src/26820.h"
#include "src/2E110.h"
#include "src/3FB0.h"
#include "src/49790.h"
#include "src/6A40.h"
#include "src/6BC0.h"
#include "src/F420.h"
#include "src/dp_intro.h"
#include "src/math_util.h"
#include "src/memory.h"
#include "src/stage_loader.h"
#include "src/util.h"

typedef struct unk_D_8690A69C {
    /* 0x000 */ unk_D_86002F58_004_000_010_024* unk_000;
    /* 0x004 */ unk_D_86002F58_004_000 unk_004;
    /* 0x16C */ s32 unk_16C;
} unk_D_8690A69C; // size = 0x170

typedef struct unk_D_8690A718 {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ char unk02[0xE];
} unk_D_8690A718; // size = 0x10

typedef struct unk_D_86908CA0 {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ u8 unk_01;
    /* 0x04 */ f32 unk_04;
} unk_D_86908CA0; // size = 0x8

typedef struct unk_D_86909168 {
    /* 0x0 */ s32 unk_00;
    /* 0x4 */ s32 unk_04;
} unk_D_86909168; // size = 0x8

typedef struct unk_D_869091B8 {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u16 unk_02;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ char unk14[0xC];
} unk_D_869091B8; // size = 0x20

static u8 D_86908A80[] = {
    0x00, 0x01, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F, 0x11,
};

static s32 D_86908A90[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 0xB, 0xFF };

static u32 D_86908ABC[] = {
    0x0C00FFFF, 0x05000000, 0x0B00001E, 0x00000000, 0x014000F0, 0x0000000F, 0x00000000, 0x00000000, 0x05000000,
    0x0D000000, 0x05000000, 0x07000000, 0x8690A610, 0x14000000, 0x002D0019, 0xFFFFFF28, 0x08000000, 0x86900020,
    0x00000000, 0x14000000, 0x002D0019, 0x80808028, 0x08000000, 0x86900088, 0x00000000, 0x16646464, 0x0F000002,
    0x05000000, 0x1F00FFFF, 0x00000000, 0x00000000, 0x00000000, 0x00640064, 0x00640000, 0x08000000, 0x869000F4,
    0x00000000, 0x05000000, 0x07000000, 0x8690A630, 0x06000000, 0x06000000, 0x0F000003, 0x05000000, 0x1F00FFFF,
    0x00000000, 0x00000000, 0x00000000, 0x00640064, 0x00640000, 0x08000000, 0x869000F4, 0x00000000, 0x05000000,
