#include "fragment62.h"
#include "src/30640.h"
#include "src/6A40.h"
#include "src/math_util.h"
#include "include/math.h"

typedef struct unk_D_843951D0_1010 {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ s16 unk_10;
} unk_D_843951D0_1010; // size = 0x14

typedef struct unk_D_843951D0 {
    /* 0x0000 */ s16 unk_0000;
    /* 0x0004 */ f32 unk_0004;
    /* 0x0008 */ s16 unk_0008;
    /* 0x000A */ s16 unk_000A;
    /* 0x000C */ Vtx* unk_000C;
    /* 0x0010 */ char unk0010[0x1000];
    /* 0x1010 */ unk_D_843951D0_1010 unk_1010[16][16];
} unk_D_843951D0; // size >= 0x2410

static unk_D_843925E0 D_843925E0[4];
static s16 D_843951C0;
static s16 D_843951C2;
static s32 pad_D_843951C8[2];
static unk_D_843951D0 D_843951D0;
static s16 D_843975E0;
static s16 D_843975E2;
static s16 D_843975E4;
static unk_D_843975E8 D_843975E8;

func_D_84390320 D_84388280[] = {
    func_843593A0, func_843593A0, func_843593A0, func_843593A0, func_8435BED8, func_84359684, func_843593A0,
    func_84359FE0, func_843593A0, func_843593A0, func_843593A0, func_8435A7F0, func_843593A0, func_843593A0,
    func_843593A0, func_843593A0, func_843593A0, func_843593A0, func_843593A0, func_84359C84, func_843593A0,
    func_843593A0, func_843593A0, func_843593A0, func_843593A0, func_843593A0, func_8435B8E8, func_843593A0,
    func_843593A0, func_843593A0, func_843593A0, func_843593A0, func_843593A0, func_8435A298, func_843593A0,
