#include "fragment39.h"
#include "src/12D80.h"
#include "src/1C720.h"
#include "src/1CF30.h"
#include "src/20330.h"
#include "src/20470.h"
#include "src/26820.h"
#include "src/2E110.h"
#include "src/3FB0.h"
#include "src/49790.h"
#include "src/4BDC0.h"
#include "src/6A40.h"
#include "src/F420.h"
#include "src/controller.h"
#include "src/fragments/2/fragment2.h"
#include "src/geo_layout.h"
#include "src/memmap.h"
#include "src/memory.h"
#include "src/stage_loader.h"

typedef struct unk_D_8250A2A0 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ s16 unk_0C;
    /* 0x0E */ s16 unk_0E;
} unk_D_8250A2A0; // size >= 0x10

static u16 D_82508AF0;
static s32 D_82508AF4;
static unk_D_82508B00* D_82508AF8;
static unk_D_82508B00 D_82508B00[4];
static unk_D_82508B30 D_82508B30[14];
static unk_D_8250A228* D_8250A228[2];
static unk_D_8250A228* D_8250A230[2];
static unk_D_8250A228* D_8250A238;
static unk_D_8250A228* D_8250A240[9];
static BinArchive* D_8250A264;
static void* D_8250A268;
static s16 D_8250A26C;
static s16 D_8250A26E;
static GraphNode* D_8250A270;
static GraphNode* D_8250A274;
static GraphNode* D_8250A278;
static GraphNode* D_8250A27C;
static GraphNode* D_8250A280;
static GraphNode* D_8250A284;
static unk_D_8250A288 D_8250A288;
static s16 D_8250A292;
static s16 D_8250A294;
static s16 D_8250A296;
static s16 D_8250A298;
static unk_D_8250A2A0 D_8250A2A0;
static s32 pad_D_8250A2B0[18];
static s32 pad_D_8250A2F8;
static s16 D_8250A2FC;
static s16 D_8250A2FE;
static s16 D_8250A300;
unk_D_800AC870* D_8250A304;
static unk_D_8250A308 D_8250A308;
