#include "fragment18.h"
#include "src/12D80.h"
#include "src/17300.h"
#include "src/19840.h"
#include "src/1C720.h"
#include "src/1CF30.h"
#include "src/20470.h"
#include "src/2E110.h"
#include "src/3FB0.h"
#include "src/490A0.h"
#include "src/49790.h"
#include "src/4BA90.h"
#include "src/4BDC0.h"
#include "src/4CBC0.h"
#include "src/50860.h"
#include "src/6A40.h"
#include "src/6BC0.h"
#include "src/fragments/2/fragment2.h"
#include "src/fragments/34/fragment34.h"
#include "src/memory.h"
#include "src/stage_loader.h"
#include "src/geo_layout.h"

extern u8 D_03034E40[];
extern u8 D_03035A80[];
extern u8 D_030366C0[];
extern u8 D_03037300[];
extern u8 D_030397C0[];
extern u8 D_0303A400[];
extern u8 D_0303B040[];
extern u8 D_0303D500[];
extern u8 D_03040580[];
extern u8 D_03040980[];
extern u8 D_03040D80[];
extern u8 D_03041FC0[];
extern u8 D_03043520[];
extern u8 D_03043C40[];
extern u8 D_030426E0[];
extern u8 D_03042E00[];

typedef struct unk_D_86C12008 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ s16 unk_0C;
} unk_D_86C12008; // size = 0xE

typedef struct unk_D_86C0E1CC {
    /* 0x00 */ Vec3f unk_00;
    /* 0x0C */ char unk0C[0x6];
    /* 0x12 */ s16 unk_12;
    /* 0x12 */ s16 unk_14;
} unk_D_86C0E1CC; // size = 0x18

static unk_func_8790002C D_86C0E480[9];
static unk_func_8790002C D_86C0FCD8[9];
static unk_func_8790002C D_86C11530[4];
static unk_D_800AC870* D_86C12000;
static unk_D_86C12008 D_86C12008[3];
static s32 D_86C12034;
static s16 D_86C12038;
static s16 D_86C12040[9][4];
static s16 D_86C12088;

static u32 D_86C04840[] = {
    0x07070707, 0x07070707, 0x07070707, 0x07070707, 0x07070708, 0x08080808, 0x08080808, 0x08080808, 0x08080808,
    0x08080805, 0x05050505, 0x05050505, 0x05050505, 0x05050505, 0x05050506, 0x06060606, 0x06060606, 0x06060606,
    0x06060606, 0x06060606, 0x06060606, 0x06060606, 0x06060606, 0x06060606, 0x06060607, 0x07070707, 0x07070707,
    0x07070707, 0x07070707, 0x07070708, 0x08080808, 0x08080808, 0x08080808, 0x08080808, 0x08080805, 0x05050505,
    0x05050505, 0x05050505, 0x05050505, 0x05050505, 0x08080808, 0x08080808, 0x08080808, 0x08080808, 0x08080805,
