#include "232C0.h"
#include "src/26820.h"
#include "src/2E110.h"
#include "src/gb_tower.h"
#include "src/hal_libc.h"
#include "src/util.h"

extern unk_D_800AC910 D_800AC910[4];
extern u32 D_800ACA70;
extern u8 D_800ACA74;
extern u8 D_800ACA75;
extern unk_D_800AC910_050 D_800ACA78;

extern u8 D_80073267[];
extern u8 D_800732FF[];

extern char D_800AC890[][0x20];

u16 func_800226C0(s32 arg0, u32 arg1) {
    s32 i;

    for (i = 1; i < 100; i++) {
        if (arg1 < func_800224B8(arg0, i + 1)) {
            break;
        }
    }

    return i;
}

void func_80022734(unk_func_80026268_arg0* arg0) {
    extern unk_D_80072B00 D_80072B00[];

    s32 i;
    s32 temp_a3;
    s32 var_v0;
    s32 idx;

    func_80022338(arg0);
    arg0->unk_05 = 0;
    arg0->unk_02 = arg0->unk_26;

    for (i = 0; i < 4; i++) {
        if (arg0->unk_09[i] != 0) {
            temp_a3 = (arg0->unk_20[i] >> 6) & 3;
            var_v0 = D_80072B00[arg0->unk_09[i] - 1].unk_05;

            if (var_v0 >= 0x28) {
                var_v0 = var_v0 + (temp_a3 * 7);
            } else {
                var_v0 = var_v0 + ((var_v0 / 5) * temp_a3);
            }

            arg0->unk_20[i] = (temp_a3 << 6) + var_v0;
        }
    }
}

void func_800228B0(unk_func_80026268_arg0* arg0) {
    UNUSED s32 pad;
    char sp18[11];

    func_80021B7C(&sp18, &arg0->unk_3B);
    _bcopy(&sp18, arg0->unk_46, 0xB);
}

#pragma GLOBAL_ASM("asm/us/nonmatchings/232C0/func_800228F0.s")


                    var_v1 = func_8002797C(arg2->unk_01, arg2->unk_03, arg2->unk_0A, arg0);
                    break;

                case 32:
                    var_v1 = func_80024CB0(arg2->unk_01, arg2->unk_02, arg2->unk_03, arg2->unk_0A, arg0);
                    break;
            }

            tmp = var_s3 > 0;
            if (var_v1 == 0) {
                break;
            }

            arg2->unk_0A++;
            var_s3 -= 1;
            var_s4 += 1;
            arg0 += arg2->unk_05;

            if (!tmp) {
                break;
            }
        }
    }
    return var_s4;
}

s32 func_80022F24(u8* arg0, s32 arg1, unk_func_80022C28_ret* arg2) {
    s32 var_s2;
    s32 var_s4;
    s32 var_s5;
    s32 tmp;

    var_s5 = 0;
    var_s4 = arg1 - 1;
    tmp = arg1 > 0;

    if (tmp) {}

    if (tmp) {
        for (; arg2->unk_0A < arg2->unk_06;) {
            var_s2 = 0;
            switch (arg2->unk_01 & 0xF0) {
                case 16:
                    var_s2 = func_80027C24(arg2->unk_01, arg2->unk_03, arg2->unk_0A, arg0);
                    arg2->unk_08 = func_800275E0(arg2->unk_01, arg2->unk_03);
                    break;

                case 32:
                    var_s2 = func_80024DAC(arg2->unk_01, arg2->unk_02, arg2->unk_03, arg2->unk_0A, arg0);
                    arg2->unk_08 = func_80024A48(arg2->unk_01, arg2->unk_02, arg2->unk_03);
                    break;
            }

            tmp = var_s4 > 0;
            if (var_s2 == 0) {
                break;
            }

            var_s4 -= 1;
            arg2->unk_0A++;
            var_s5 += 1;
            arg0 += arg2->unk_05;
            arg2->unk_04 |= 1;

            if (!tmp) {
                break;
            }
        }
    }

    return var_s5;
}

void func_80023068(void) {
    char** sp1C = func_8002D5AC(0x11);

    HAL_Strcpy(D_800AC890[0], func_8002D7C0(NULL, 0, sp1C, 0));
    HAL_Strcpy(D_800AC890[1], func_8002D7C0(NULL, 0, sp1C, 1));
    HAL_Strcpy(D_800AC890[2], func_8002D7C0(NULL, 0, sp1C, 2));
    HAL_Strcpy(D_800AC890[3], func_8002D7C0(NULL, 0, sp1C, 3));
}

char* func_8002311C(s32 arg0) {
    return D_800AC890[arg0];
}

s32 func_80023130(u8* arg0) {
    s32 i;

    for (i = 0; i < 11; i++) {
        if (*arg0++ == 'P') {
            return 1;
        }
    }

    return 0;
}

s32 func_80023230(u8* arg0, u8* arg1) {
    s32 sp1C = 0;
    s32 sp18 = 0;

    if (func_80023130(arg0) != 0) {
        while (arg1 >= arg0) {
            sp18 += *arg0++;
        }
        sp1C = (sp18 & 0xFF) == 0xFF;
    }

    return sp1C;
}

void func_800232A0(u8* arg0, u8* arg1) {
    s32 var_v0 = 0;

    while (arg0 < arg1) {
        var_v0 += *arg0++;
    }

    *arg1 = 0xFF - (var_v0 & 0xFF);
}

s32 func_800232D0(u8* arg0, s32 arg1) {
    u8* var_v0 = D_800ACA78.unk_000;

    while (arg1-- > 0) {
        if (*arg0++ != *var_v0++) {
            return 0;
        }
    }

    return 1;
}

s8 func_80023324(s32 arg0) {
    // Only part of the rom header,
    // osGbpakReadId reads from 0x100 but this reads from 0x120
    typedef struct RomHeader {
        /* 0x00 */ char nintendo_chr[0x14];
        /* 0x14 */ char game_title[16];
        /* 0x24 */ u16 company_code;
        /* 0x26 */ u8 body_code;
        /* 0x27 */ u8 cart_type;
        /* 0x28 */ u8 rom_size;
        /* 0x29 */ u8 ram_size;
        /* 0x2A */ s8 country_code;
        /* 0x2B */ u8 fixed2;
        /* 0x2C */ u8 version;
        /* 0x2D */ u8 isum;
        /* 0x2E */ u16 sum;
        /* 0x30 */ char unk30[0x30];
    } RomHeader; // size = 0x60

    RomHeader sp28;
    s8 var_s0 = POKEMON_ROM_NONE;

    if ((func_8000B1C4(arg0, &sp28, 0x120, 0x60) == 0) && (sp28.country_code == 1)) {
        sp28.game_title[7] = '\x0';
        sp28.game_title[16] = '\x0';

        if (HAL_Strcmp(&sp28.game_title[0], "POKEMON") == 0) {
            if (HAL_Strcmp(&sp28.game_title[8], "RED") == 0) {
                var_s0 = POKEMON_ROM_RED;
            } else if (HAL_Strcmp(&sp28.game_title[8], "GREEN") == 0) {
                var_s0 = POKEMON_ROM_GREEN;
            } else if (HAL_Strcmp(&sp28.game_title[8], "BLUE") == 0) {
                var_s0 = POKEMON_ROM_BLUE;
            } else if (HAL_Strcmp(&sp28.game_title[8], "YELLOW") == 0) {
                var_s0 = POKEMON_ROM_YELLOW;
            }
        }
    }

    return var_s0;
}

s32 func_800233F4(s32 arg0) {
    UNUSED s32 pad;
    s32 sp18 = 0;

