#include "30640.h"
#include "include/math.h"
#include "src/fragments/15/fragment15.h"
#include "src/fragments/34/fragment34.h"
#include "src/11BA0.h"
#include "src/12D80.h"
#include "src/17300.h"
#include "src/18140.h"
#include "src/geo_layout.h"
#include "src/19840.h"
#include "src/1C720.h"
#include "src/1CF30.h"
#include "src/29BA0.h"
#include "src/3FB0.h"
#include "src/37370.h"
#include "src/4BDC0.h"
#include "src/F420.h"
#include "src/math_util.h"
#include "src/memory.h"
#include "src/util.h"

typedef struct {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;

    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ s16 unk_0C;
    /* 0x0E */ s16 unk_0E;
} unk_D_800761B0; /* size = 0x40 */

typedef struct unk_func_8003013C_arg1 {
    /* 0x00 */ u8 pad00[0x1C];
    /* 0x1C */ s16 unk_1C;
    /* 0x1E */ s16 unk_1E;
} unk_func_8003013C_arg1; // size >= 0x20

extern unk_func_80031270* D_80075F80;
extern unk_func_80031270* D_80075F84;
extern u32* D_80075F88;
extern unk_D_80068BB0* D_80075F90;
extern s32 D_80075F94;
extern s32 D_80075F98;
extern s32 D_80075F9C;
extern u32 D_80075FA0[];
extern u32 D_8007616C[];
extern unk_D_800761B0 D_800761B0[12];
extern f64 D_8007C538;
extern f64 D_8007C540;
extern f64 D_8007C548;
extern f64 D_8007C550;
extern f64 D_8007C558;
extern f64 D_8007C560;
extern f64 D_8007C568;
extern f64 D_8007C570;

void func_800318B8(void);
void func_8340051C(void);

void func_8002FA40(void) {
    s32 var_s6;
    u32* temp_s0;
    u32 var_s0;
    u32 var_s2;
    u32 sp64;
    u32 var_s5;
    u32 sp5C;
    s32 var_v0;
    unk_D_83407B00* val;

    val = &D_83407B30;
    var_s2 = 0;
    var_s5 = 0;

    main_pool_push_state('SNPM');
    func_8004B1CC(0x4B);

    FRAGMENT_LOAD(fragment43)();
    FRAGMENT_LOAD(fragment34);

    do {
