#include "fragment23.h"
#include "src/1CF30.h"
#include "src/20330.h"
#include "src/22630.h"
#include "src/26820.h"
#include "src/29BA0.h"
#include "src/2D340.h"
#include "src/2E110.h"
#include "src/2E460.h"
#include "src/49790.h"
#include "src/hal_libc.h"
#include "src/memmap.h"
#include "src/memory.h"
#include "src/stage_loader.h"

typedef struct unk_D_88218060 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ Color_RGBA8* unk_04;
} unk_D_88218060; // size = 0x8

typedef struct unk_D_88218070 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ u8* unk_08;
    /* 0x0C */ s16 unk_0C;
    /* 0x10 */ Color_RGBA8* unk_10;
} unk_D_88218070; // size = 0x14

static char** D_88224FC0;
static char** D_88224FC4;
static char** D_88224FC8;
static char** D_88224FCC;

void func_8820C930(s32 arg0, s32 arg1, s32 arg2, unk_func_8820BE14_06C* arg3) {
    unk_func_80022C28_ret* sp1C = func_80022C28(arg0, arg1, arg2, 0);

    arg3->unk_08 = func_80022E18(arg3->unk_00, arg3->unk_04, sp1C);
    func_80022D8C(sp1C);
}

void func_8820C97C(s32 arg0, s32 arg1, s32 arg2, unk_func_8820BE14_06C* arg3, s32 arg4, char* arg5, s32 arg6) {
    unk_func_80022C28_ret* sp2C;

    if (arg6 != -1) {
        if (1) {}
        sp2C = func_80022CC0(arg0, arg1, arg2, arg4, arg5, arg6);
    } else {
        sp2C = func_80022C28(arg0, arg1, arg2, 1);
    }

    func_80022F24(arg3->unk_00, arg3->unk_08, sp2C);

    if ((arg0 == 0x10) || (arg0 == 0x11) || (arg0 == 0x12)) {
        func_80022D24(sp2C);
    } else {
        func_80022D8C(sp2C);
    }
}

void func_8820CA2C(unk_func_8821421C_07C* arg0) {
