#include "fragment23.h"
#include "src/12D80.h"
#include "src/1AB70.h"
#include "src/1CF30.h"
#include "src/20330.h"
#include "src/26820.h"
#include "src/29BA0.h"
#include "src/2D340.h"
#include "src/2E110.h"
#include "src/3FB0.h"
#include "src/49790.h"
#include "src/hal_libc.h"
#include "src/fragments/25/fragment25.h"
#include "src/memmap.h"
#include "src/memory.h"
#include "src/stage_loader.h"

typedef void (*ThreadEntries)(unk_func_8820BE14*);

typedef struct unk_D_88217D10 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ u8 unk_08;
    /* 0x09 */ u8 unk_09;
    /* 0x0A */ u8 unk_0A;
    /* 0x0B */ u8 unk_0B;
} unk_D_88217D10; // size = 0xC

typedef struct unk_D_88217E40 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ u8* unk_10;
} unk_D_88217E40; // size = 0x14

typedef struct unk_D_88217EA4 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ u8* unk_08;
    /* 0x0C */ s16 unk_0C;
    /* 0x0E */ s16 unk_0E;
    /* 0x10 */ Color_RGBA8* unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ u16 unk_18;
} unk_D_88217EA4; // size = 0x1C

void func_8820C5BC(unk_func_8820BE14*);
void func_8820C63C(unk_func_8820BE14*);
void func_88207C54(unk_func_8820B12C_02C*);
s32 func_8820ADEC(unk_func_8820BE14_02C*);
void func_88207C34(unk_func_8820B12C_02C*, s32);
void func_88207D0C(unk_func_8820B12C_02C*, s32);
s32 func_88208600(unk_func_8820B12C_02C*, Controller*);
s32 func_8820AF78(unk_func_8820BE14_02C*, Controller*);
void func_8820B0A0(unk_func_8820BE14_02C*, s32);
void func_8820B12C(unk_func_8820B12C*, unk_func_8820BE14_02C*);
s32 func_8820B838(unk_func_8820B12C*, Controller*);
void func_88207A54(unk_func_882079D8* arg0, unk_func_88205880_00D0* arg1);
s32 func_88207A5C(unk_func_882079D8*, s32, s32);
s32 func_88206F44(unk_func_8820BE14_02C_078*, Controller*);
s32 func_88208CE4(unk_func_88208C5C*, s32, s32);
void func_88209A88(unk_func_8820BE14_02C_070* arg0, unk_func_88205880_00D0* arg1);
s32 func_8820938C(unk_func_8820BE14_02C_070*, s32, s32);

